{
  "plugins": {
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "copilot-lsp": {
      "src": "https://github.com/copilotlsp-nvim/copilot-lsp"
    },
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "harpoon": {
      "src": "https://github.com/theprimeagen/harpoon",
      "version": "'master'"
    },
    "markdown-plus.nvim": {
      "src": "https://github.com/YousefHadder/markdown-plus.nvim"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-tree-preview.lua": {
      "src": "https://github.com/b0o/nvim-tree-preview.lua"
    },
    "nvim-tree.lua": {
      "src": "https://github.com/nvim-tree/nvim-tree.lua"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'main'"
    },
    "oh-lucy.nvim": {
      "src": "https://github.com/Yazeed1s/oh-lucy.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "treesitter-modules.nvim": {
      "src": "https://github.com/MeanderingProgrammer/treesitter-modules.nvim"
    },
    "twilight.nvim": {
      "src": "https://github.com/folke/twilight.nvim"
    },
    "watcher.nvim": {
      "src": "https://github.com/jgYro/watcher.nvim"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    }
  }
}
